[
    {
        "headline": "Attestation for UAE",
        "text": "Certificate Attestation from HRD,Home Department, MEA Attestation .The Government of UAE requires all educational/Personal certificates, professional or academic being issued from India to be attested by the Embassy/Consulate in UAE for further attestation by the Ministry of Foreign Affairs of UAE Government before granting UAE Visa."
    },
    {
        "headline": "UAE Certificate Attestation: Notary Functions",
        "text": "Certificates attestation for UAE (Abu Dhabi, Dubai, Sharjah).First completion of Notary. After getting attestation from notary you can submit the certificates for home department attestation. Stating that certificate is true to get attestation from Home Department."
    },
    {
        "headline": "Home Department Functions in UAE Certificate Attestation",
        "text": "To submit the documents to MEA, Initially you need to get attestation from Home Department. A certificate is authenticated by Home Department after verifying the content of the specified certificate. Authentication is the truly an accurate representation of the authenticity of that specified certificate, all the formalities stand as same for UAE certificates attesting and Abu Dhabi certificates attesting, Dubai certificates attesting, Sharjah certificates attesting The State Human Resource Department (HRD) is attested all certificates issued by Govt. School, Govt. Technical Board, Medical & Paramedical Institution, university and others.. After completing the attestation process the certificate can proceed to the ministry of External Affairs & Embassy Attestation. You can do with the Mantralya attestation as well to get MEA attestation."
    },
    {
        "headline": "MEA Attestation for UAE",
        "text": "MEA attestation is under the ministry of external affairs govt. Of India. Ministry of External Affairs should attest all the certificates issued in any state in India before submitting to UAE Embassy. Education department attestation or home department attestation should be done for the MEA attestation. MEA attests all educational certificate non education certificates and commercial certificates."
    },
    {
        "headline": "SDM Attestation for UAE",
        "text": "The Sub Divisional Magistrate's office is situated in Delhi. After getting Attestation from SDM , can submit the certificate to MEA attestation after that Embassy attestation of UAE (Abu Dhabi, Dubai, Sharjah)."
    },
    {
        "headline": "UAE Embassy Attestation",
        "text": "Certificate Attestation from HRD, MEA Attestation .The Government of UAE requires all educational/Personal certificates, professional or academic, issued from India to be attested by the Indian Embassy/Consulate in UAE for further attestation by the Ministry of Foreign Affairs (MOFA) of UAE Government before grant of UAE Visa. After getting successful attestation from MEA you can submit the certificates to UAE Embassy for attestation.. The embassy will attest all educational and non educational and commercial document if the certificate already attested by MEA."
    }
]