[
    {
        "headline": "China Certificate Attestation: Notary Functions",
        "text": "The Certificates needs to be attested for China formal purpose. Completion of Notary. After getting attestation from notary you can submit the certificates for home department attestation. Stating that the certificate is true to get attested from Home Department."
    },
    {
        "headline": "Home Department Functions in China Certificate Attestation",
        "text": "To submit the documents to MEA, Initially you need to get attestation from Home Department. A certificate is authenticated by Home Department after verifying the content of the specified certificate. Authentication is truly an accurate representation of the authenticity of the specified certificate, all the formalities stand as same for China certificates attesting. The State Human Resource Department (HRD) is attested all certificates issued by Govt. School, Govt. Technical Board, Medical & Paramedical Institution, university and others.. After completing the attestation process the certificate can proceed to the ministry of External Affairs & Embassy Attestation. You can do with the Mantralya attestation also to get MEA attestation."
    },
    {
        "headline": "MEA Attestation for China",
        "text": "MEA attestation is under the ministry of external affairs govt. Of India. Ministry of External Affairs should attest all the certificates issued in any state in India before submitting China Embassy. Education department attestation or home department attestation should done for the MEA attestation. MEA attests all educational certificate non education certificates and commercial certificates."
    },
    {
        "headline": "SDM Attestation for China",
        "text": "The Sub Divisional Magistrate's office is situated in Delhi. After getting Attestation from SDM, can submit the certificate to MEA attestation after that Embassy attestation."
    },
    {
        "headline": "Attestation for China",
        "text": "After getting successful attestation from MEA you can submit the certificates to China Embassy for attestation. The embassy will attest all educational and non educational and commercial document if the certificate already attested by MEA."
    },
    {
        "headline": "China Embassy Attestation",
        "text": "Certificate Attestation from HRD, MEA Attestation .The Government of China requires all educational/Personal certificates, professional or academic, issued from India to be attested by the Indian Embassy/Consulate in China for further attestation by the Ministry of Foreign Affairs of China Government before grant of China Visa."
    }
]