[
    {
        "headline": "Educational Certificate Attestation Procedure",
        "text": "If you submit your original certificate with a photocopy of your passport we will first submit your certificate to HRD where in it will be authenticated then Ministry of External Affairs India (MEA) will Attest it then we will be submitting it in Saudi Culture from there again it will go for verification to the particular University once that verification is complete then. Saudi Embassy will Attest your document."
    },
    {
        "headline": "Duration For Attestation",
        "text": "Minimum 60 working days for all the 4 process. You will have to provide yours and your employers contact numbers and email ids."
    },
    {
        "headline": "For Getting Saudi Attestation On Educational Certificates",
        "text": "Degree should be earned through Full Time / Regular Mode only. (Saudi Cultural Attaché does not attest any degree/certificate/diploma earned through online/distance/private mode)."
    },
    {
        "headline": "Offer Letter",
        "text": "For fresh candidates, Offer letter must contain the NAME, PASSPORT NUMBER, SALARY AND PROFESSION. Profession must be same as the degree (Eg:- If the candidate holding B.com degree, Its profession should be Accountant) Offer letter must be attested from the Saudi Ministry of External affairs and The Chamber of commerce. Candidates who were already working in KSA, The attestation of Saudi Ministry of External Affairs is not necessary, but they need to present the Certificate of Employment issued from his current employer/institute, attested from Chamber of Commerce and the letter should contain IQAMA number and passport number, date of his joining and Position. Offer is only valid for 6 month from the date of issue."
    },
    {
        "headline": "Documents Required For Saudi Submission",
        "text": "*Original offer letter. *Original Degree attested by HRD. *All year marksheet copy. *Undertaking from the candidate on Rs. 10 or 20 Governmental Stamp Paper about the degree genuineness, Paste photo graph in it and do notary. *Passport copy. *Pan card/Adhar Card copy. *If working, color iqama copy. *Candidate email id."
    }
]