[
    {
        "headline": "Attestation for Malaysia",
        "text": "The Certificates needs to be attested for Malaysia formal purpose. Completion of Notary. After getting attestation from notary you can submit the certificates for home department attestation. Stating that the certificate is true to get attested from Home Department."
    },
    {
        "headline": "Home Department Functions in Malaysia Certificate Attestation",
        "text": "Initially you need to get attestation from Home Department to submit the documents to MEA . A certificate is authenticated by Home Department after verifying the content of the specified certificate. Authentication is the truly an accurate representation of the authenticity of that specified certificate, all the formalities stand as same for Malaysia certificates attesting. The State Human Resource Department (HRD) is attested all certificates issued by Govt. School, Govt. Technical Board, Medical & Paramedical Institution, university and others.. After completing the attestation process the certificate can proceed to the ministry of External Affairs & Embassy Attestation. You can do with the Mantralya attestation also to get MEA attestation."
    },
    {
        "headline": "MEA Attestation for Malaysia",
        "text": "MEA attestation is under the ministry of external affairs Govt Of India. Ministry of External Affairs should attest all the certificates issued in any state in India before submitting Malaysia Embassy. Education department attestation or home department attestation should be done for the MEA attestation. MEA attests all educational certificate non education certificates and commercial certificates."
    },
    {
        "headline": "SDM Attestation for Malaysia",
        "text": "The Sub Divisional Magistrate's office is situated in Delhi. After getting Attestation from SDM , can submit the certificate to MEA attestation after that Embassy attestation."
    },    
    {
        "headline": "Malaysia Embassy Attestation",
        "text": "Certificate Attestation from HRD, MEA Attestation .The Government of Malaysia requires all educational/Personal certificates, professional or academic, issued from India to be attested by the Indian Embassy/Consulate in Malaysia for further attestation by the Ministry of Foreign Affairs of Malaysia Government before grant of Malaysia Visa."
    }
]